Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEbcu_bf.h
/** \brief Length for Ifx_EBCU_ALSTAT0_Bits.MCDS_S */
#define IFX_EBCU_ALSTAT0_MCDS_S_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALSTAT0_Bits.MCDS_S */
#define IFX_EBCU_ALSTAT0_MCDS_S_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALSTAT0_Bits.MCDS_S */
#define IFX_EBCU_ALSTAT0_MCDS_S_OFF (1u)

/** \brief Length for Ifx_EBCU_ALSTAT0_Bits.AGBT_S */
#define IFX_EBCU_ALSTAT0_AGBT_S_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALSTAT0_Bits.AGBT_S */
#define IFX_EBCU_ALSTAT0_AGBT_S_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALSTAT0_Bits.AGBT_S */
#define IFX_EBCU_ALSTAT0_AGBT_S_OFF (2u)

/** \brief Length for Ifx_EBCU_ALSTAT0_Bits.EMEM_CTRL_S */
#define IFX_EBCU_ALSTAT0_EMEM_CTRL_S_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALSTAT0_Bits.EMEM_CTRL_S */
#define IFX_EBCU_ALSTAT0_EMEM_CTRL_S_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALSTAT0_Bits.EMEM_CTRL_S */
#define IFX_EBCU_ALSTAT0_EMEM_CTRL_S_OFF (7u)

/** \brief Length for Ifx_EBCU_ALSTAT2_Bits.EBCU_M */
#define IFX_EBCU_ALSTAT2_EBCU_M_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALSTAT2_Bits.EBCU_M */
#define IFX_EBCU_ALSTAT2_EBCU_M_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALSTAT2_Bits.EBCU_M */
#define IFX_EBCU_ALSTAT2_EBCU_M_OFF (31u)

/** \brief Length for Ifx_EBCU_ALSTAT3_Bits.A_EN */
#define IFX_EBCU_ALSTAT3_A_EN_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALSTAT3_Bits.A_EN */
#define IFX_EBCU_ALSTAT3_A_EN_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALSTAT3_Bits.A_EN */
#define IFX_EBCU_ALSTAT3_A_EN_OFF (0u)

/** \brief Length for Ifx_EBCU_ALSTAT3_Bits.ABORT_EN */
#define IFX_EBCU_ALSTAT3_ABORT_EN_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALSTAT3_Bits.ABORT_EN */
#define IFX_EBCU_ALSTAT3_ABORT_EN_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALSTAT3_Bits.ABORT_EN */
#define IFX_EBCU_ALSTAT3_ABORT_EN_OFF (1u)

/** \brief Length for Ifx_EBCU_ALSTAT3_Bits.ACK_EN */
#define IFX_EBCU_ALSTAT3_ACK_EN_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALSTAT3_Bits.ACK_EN */
#define IFX_EBCU_ALSTAT3_ACK_EN_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALSTAT3_Bits.ACK_EN */
#define IFX_EBCU_ALSTAT3_ACK_EN_OFF (2u)

/** \brief Length for Ifx_EBCU_ALSTAT3_Bits.D_EN */
#define IFX_EBCU_ALSTAT3_D_EN_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALSTAT3_Bits.D_EN */
#define IFX_EBCU_ALSTAT3_D_EN_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALSTAT3_Bits.D_EN */
#define IFX_EBCU_ALSTAT3_D_EN_OFF (3u)

/** \brief Length for Ifx_EBCU_ALSTAT3_Bits.SFI_S2F_M */
#define IFX_EBCU_ALSTAT3_SFI_S2F_M_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALSTAT3_Bits.SFI_S2F_M */
#define IFX_EBCU_ALSTAT3_SFI_S2F_M_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALSTAT3_Bits.SFI_S2F_M */
#define IFX_EBCU_ALSTAT3_SFI_S2F_M_OFF (22u)

/** \brief Length for Ifx_EBCU_ALCLR_Bits.CLR0 */
#define IFX_EBCU_ALCLR_CLR0_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALCLR_Bits.CLR0 */
#define IFX_EBCU_ALCLR_CLR0_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALCLR_Bits.CLR0 */
#define IFX_EBCU_ALCLR_CLR0_OFF (0u)

/** \brief Length for Ifx_EBCU_ALCLR_Bits.CLR1 */
#define IFX_EBCU_ALCLR_CLR1_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALCLR_Bits.CLR1 */
#define IFX_EBCU_ALCLR_CLR1_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALCLR_Bits.CLR1 */
#define IFX_EBCU_ALCLR_CLR1_OFF (1u)

/** \brief Length for Ifx_EBCU_ALCLR_Bits.CLR2 */
#define IFX_EBCU_ALCLR_CLR2_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALCLR_Bits.CLR2 */
#define IFX_EBCU_ALCLR_CLR2_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALCLR_Bits.CLR2 */
#define IFX_EBCU_ALCLR_CLR2_OFF (2u)

/** \brief Length for Ifx_EBCU_ALCLR_Bits.CLR3 */
#define IFX_EBCU_ALCLR_CLR3_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALCLR_Bits.CLR3 */
#define IFX_EBCU_ALCLR_CLR3_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALCLR_Bits.CLR3 */
#define IFX_EBCU_ALCLR_CLR3_OFF (3u)

/** \brief Length for Ifx_EBCU_ALCLR_Bits.CLR4 */
#define IFX_EBCU_ALCLR_CLR4_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALCLR_Bits.CLR4 */
#define IFX_EBCU_ALCLR_CLR4_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALCLR_Bits.CLR4 */
#define IFX_EBCU_ALCLR_CLR4_OFF (4u)

/** \brief Length for Ifx_EBCU_ALCLR_Bits.CLR5 */
#define IFX_EBCU_ALCLR_CLR5_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALCLR_Bits.CLR5 */
#define IFX_EBCU_ALCLR_CLR5_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALCLR_Bits.CLR5 */
#define IFX_EBCU_ALCLR_CLR5_OFF (5u)

/** \brief Length for Ifx_EBCU_ALCLR_Bits.CLR6 */
#define IFX_EBCU_ALCLR_CLR6_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALCLR_Bits.CLR6 */
#define IFX_EBCU_ALCLR_CLR6_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALCLR_Bits.CLR6 */
#define IFX_EBCU_ALCLR_CLR6_OFF (6u)

/** \brief Length for Ifx_EBCU_ALCLR_Bits.CLR7 */
#define IFX_EBCU_ALCLR_CLR7_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALCLR_Bits.CLR7 */
#define IFX_EBCU_ALCLR_CLR7_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALCLR_Bits.CLR7 */
#define IFX_EBCU_ALCLR_CLR7_OFF (7u)

/** \brief Length for Ifx_EBCU_ALCLR_Bits.CLR8 */
#define IFX_EBCU_ALCLR_CLR8_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALCLR_Bits.CLR8 */
#define IFX_EBCU_ALCLR_CLR8_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALCLR_Bits.CLR8 */
#define IFX_EBCU_ALCLR_CLR8_OFF (8u)

/** \brief Length for Ifx_EBCU_ALCLR_Bits.CLR9 */
#define IFX_EBCU_ALCLR_CLR9_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALCLR_Bits.CLR9 */
#define IFX_EBCU_ALCLR_CLR9_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALCLR_Bits.CLR9 */
#define IFX_EBCU_ALCLR_CLR9_OFF (9u)

/** \brief Length for Ifx_EBCU_ALCLR_Bits.CLR10 */
#define IFX_EBCU_ALCLR_CLR10_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALCLR_Bits.CLR10 */
#define IFX_EBCU_ALCLR_CLR10_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALCLR_Bits.CLR10 */
#define IFX_EBCU_ALCLR_CLR10_OFF (10u)

/** \brief Length for Ifx_EBCU_ALCLR_Bits.CLR11 */
#define IFX_EBCU_ALCLR_CLR11_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALCLR_Bits.CLR11 */
#define IFX_EBCU_ALCLR_CLR11_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALCLR_Bits.CLR11 */
#define IFX_EBCU_ALCLR_CLR11_OFF (11u)

/** \brief Length for Ifx_EBCU_ALCLR_Bits.CLR12 */
#define IFX_EBCU_ALCLR_CLR12_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALCLR_Bits.CLR12 */
#define IFX_EBCU_ALCLR_CLR12_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALCLR_Bits.CLR12 */
#define IFX_EBCU_ALCLR_CLR12_OFF (12u)

/** \brief Length for Ifx_EBCU_ALCLR_Bits.CLR13 */
#define IFX_EBCU_ALCLR_CLR13_LEN (1u)

/** \brief Mask for Ifx_EBCU_ALCLR_Bits.CLR13 */
#define IFX_EBCU_ALCLR_CLR13_MSK (0x1u)

/** \brief Offset for Ifx_EBCU_ALCLR_Bits.CLR13 */
#define IFX_EBCU_ALCLR_CLR13_OFF (13u)

